{
  "participants": [
    {
      "name": "Mariko Kusumoto"
    },
    {
      "name": "Bryn Dyment"
    }
  ],
  "messages": [
    {
      "sender_name": "Mariko Kusumoto",
      "timestamp_ms": 1706858491223,
      "content": "â\u009d¤ï¸\u008f",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Bryn Dyment",
      "timestamp_ms": 1706857037727,
      "content": "Thatâ\u0080\u0099s the challenge with international families, but I think itâ\u0080\u0099s worth it!",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Mariko Kusumoto",
      "timestamp_ms": 1706737585761,
      "content": "Thank you so much for Akane's information and your family. I also have one daughter. She is 24 years old and she got married a few years ago. I'm little bit sad that if we move to Japan, I won't be able to see her often anymore, so this is a big decision I have to make. I love going to abroad like you. Even we settle down in Japan, I'm planning to go to different county and have exhibitions. I probably will create things until the day I die. That's my dream! Anyway Take care and keep in touch! Thank you so much again for contacting me.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Bryn Dyment",
      "timestamp_ms": 1706657141778,
      "content": "https://www.instagram.com/akanegoda/",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Bryn Dyment",
      "timestamp_ms": 1706657083259,
      "content": "I am not surprised that your metal pieces have all been sold. I remember not being able to afford your work 25 years ago and I doubt anything's changed.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Bryn Dyment",
      "timestamp_ms": 1706657025760,
      "content": "I think Tokyo is my \"forever home\" although I still plan to travel and live abroad for stints. Right now, I am thinking about moving to Mexico City after Mirei graduates from high school (which is thus June).",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Bryn Dyment",
      "timestamp_ms": 1706656947213,
      "content": "Akane and I moved to Kyoto in 2009. Riku, our son, is in college in Vancouver, BC. Mirei, our daughter, is finishing up high school here in Tokyo. Akane is still in Kyoto. I remember our car camping trip â\u0080¦ some details at least. Akane made okonomiyaki.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Mariko Kusumoto",
      "timestamp_ms": 1706623359281,
      "content": "Yes I remember you!!!!! I'm surprise to know that you live in Tokyo now. Do you work there? We are thinking about moving to Japan a few years from now. My husband Glenn look forward to retiring in Japan. I'm sorry to hear that you are not with Akane anymore. I lost contact with her. Does she have Instagram account?                                                                          Anyway, thank you so much for remembering my old metal pieces. Unfortunately all my metal pieces were already sold. I probably go back to metal when I get tire of fabric. Anyway, It's so nice to hear from you. Keep in touch and I hope we will see you in Japan in the future if you are still there!",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Bryn Dyment",
      "timestamp_ms": 1706603901331,
      "content": "Hello â\u0080¦ you might remember me from SF. I'm Akane Goda's ex-husband. I live in Tokyo now. I still remember quite vividly you showing us a sushi-related metallic sculpture. I am wondering if you happen to have any of your older metallic pieces for sale? I doubt I can afford them but I thought I would ask.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    }
  ],
  "title": "Mariko Kusumoto",
  "is_still_participant": true,
  "thread_path": "inbox/marikokusumoto_1242961733758886",
  "magic_words": [
    
  ]
}