{
  "participants": [
    {
      "name": "Bryn Dyment"
    },
    {
      "name": "Princess Cinemas"
    }
  ],
  "messages": [
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1311692545000,
      "content": "The first film of Velcrow Ripper's acclaimed 'Love Evolve' trilogy, Scared Sacred is a feature documentary that asks the question: can we be Scared into the Sacred? The film takes us on a journey to the pivotal ground zeros of the world, places like Bosnia, Hiroshima, New York City and Afghanistan in search of stories of hope and meaning. \n\nPreceding the screening energy healer Tanis Day, PhD, will give a talk on energy awareness skills for self or healing work.\n\nEveryone welcome! ",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1310002513000,
      "content": "On July 28th, 7:00 at the Original, there will be a FREE screening of Velcrow Ripper's SCARED SACRED, the first of his EVOLVE LOVE documentary trilogy.\n\nPlease join us! ",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1309882361000,
      "content": "Legendary singer-songwriter FERRON will be returning to the Original Princess, Friday July 29th for a rare performance. Ferron doesn't tour as much as she used to, so this show will be special. If you've never seen Ferron, don't miss this opportunity. If you have seen her, we're sure you'll be making plans to come!\n\nAdvance tickets ($28) are available at the Twin and Old Goat Books, and on-line at Eventbrite http://ferronjuly29.eventbrite.com/\nor by phone at (519)880-9595 (Old Goat)",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1305031309000,
      "content": "Music From the Big House, from acclaimed director Bruce McDonald (Roadkill, HWY 61) is an inspiring documentary that follows award-winnning blues musician Rita Chiarelli to Lousiana State Penitentiary, where she puts on a concert with some of the musical inmates. Music From the Big House is a powerful film about healing and the redemptive power of music. \nTickets are available at the Twin and on-line at http://musicfromthebighouse.eventbrite.com/",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1304292667000,
      "content": "CANADA FILM DAYS Closing Night Event!  7pm, May 11th.\n\nJoin us for a fantastic evening of film and music. Award-winning blues performer Rita Chiarelli teams up with iconic Canadian director Bruce McDonald (Roadkill, HWY 61) in MUSIC FROM THE BIG HOUSE, an inspiring and healing musical journey to one of America's most notorious prisons.\n\nRita will perform Live On Stage after the film!\nAdvance tickets ($25) on sale now at the Princess Twin and on-line at http://musicfromthebighouse.eventbrite.com/ ",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1304033833000,
      "content": "It's here! The Canada Film Days Pancake Breakfast! Friday 8am-11am at the Princess Cafe. Marc is making gourmet apple pancakes (with caramelized apples), local maple syrup and cider! Event is free and open to everyone. Film announcements at 10am. Dress Canadian!",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1302638063000,
      "content": "Come help us celebrate the LAUNCH of CANADA FILM DAYS in an iconic Canadian way:  A Pancake Breakfast! \nApril 29th, 8am-11am at the Princess Cafe.\nFilm Festival announcements at 10 am. Everyone Welcome!\n\nPancakes for a Loonie. Maple Syrup from Bauman's Farm. Fresh Apple Cider from Martin's Farm. Dress: Canadian\n\nCANADA FILM DAYS FESTIVAL\nMay 5 - May 11, 2011\nA Celebration of New Canadian Cinema\nOriginal Princess Cinema, Waterloo, Ontario\n\nFull schedule of events is available at http://www.canadafilmdays.ca/\n\nFor advance online tickets:\nhttp://www.eventbrite.com/org/1042044607?s=3747755\n\nFor interviews with the various directors and actors attending the festival or more information please contact John Tutt at 519 884-5112",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1297393956000,
      "content": "Hope to see you there! 7:00 showtime.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1292257871000,
      "content": "A little dose of Fred will get you in the Christmas spirit! Get your tickets now! Advance tickets ($28) on sale at the Princess Twin Box Office and Old Goat Books in Waterloo. Phone sales (519)880-9595.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1290873637000,
      "content": "With Special Guests, the Gin Sisters. Cha Cha Cha.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1290610136000,
      "content": "Live on Stage at the Original TOMORROW. Canadian folk legend and brother of the late Stan Rogers. Advance tickets ($20) on sale now at the Twin and Old Goat Books.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1290609642000,
      "content": "Tickets now on sale ($20) at the Princess Twin Box Office and Old Goat Books. (519)880-9595.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1274273667000,
      "content": "Objectified, the new film from Helvetica director Gary Hustwit, comes to the Original Princess one night only. Thursday, May 20 at 7:00.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1271332766000,
      "content": "Canada 2010, 43 minutes. Directed by Peter Mettler.\nPETROPOLIS: AERIAL PERSPECTIVES ON THE ALBERTA TAR SANDS is a hypnotic documentary that offers an unparalleled view of the Canada's most controversial natural resource. Produced by Greenpeace Canada and shot primarily from a helicopter, the film addresses the tar sands impact on the environment, yet it does so with the all stunning imagery that's become a Mettler trademark. WCI has a screen 35 feet wide and 15 feet tall, bigger than our screens at the Princess Twin. TO APPRECIATE THE SCALE OF THE TAR SANDS, WE DECIDED TO PRESENT THIS FILM ON THE BIGGEST SCREEN WE COULD FIND. WCI and Alternatives Magazine are assisting in this special presentation. Advance tickets are $10 and available for purchase at the Twin Box Office and Old Goat Books.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    },
    {
      "sender_name": "Princess Cinemas",
      "timestamp_ms": 1269871739000,
      "content": "Tickets are limited. Available at the Twin Box Office or Old Goat Books. Scott Wicken will be opening this show.",
      "is_geoblocked_for_viewer": false,
      "is_unsent_image_by_messenger_kid_parent": false
    }
  ],
  "title": "Princess Cinemas",
  "is_still_participant": true,
  "thread_path": "filtered_threads/princesscinemas_1680374528896711",
  "magic_words": [
    
  ],
  "joinable_mode": {
    "mode": 1,
    "link": ""
  }
}